"""
课件案例结果：
分析： 与课件上结果不一致，怀疑参数输入有误
错误部分：586行附近，teacher_forcing处，为Ttue时，最后应该为decoder_input，变量名写错，下一步的输入
没有进行矫正，所以训练速度减慢
# 可以测试下修改teacher大小
7m 48s (5000 6%) 3.6319
15m 33s (10000 13%) 3.4498
22m 42s (15000 20%) 3.4362
30m 18s (20000 26%) 3.3458
37m 51s (25000 33%) 3.2968
45m 30s (30000 40%) 3.2223
52m 57s (35000 46%) 3.1385
60m 27s (40000 53%) 3.1196
67m 56s (45000 60%) 3.0777
75m 17s (50000 66%) 2.9859
82m 28s (55000 73%) 2.9348
89m 56s (60000 80%) 2.8791
97m 41s (65000 86%) 2.8802
105m 25s (70000 93%) 2.8203
113m 3s (75000 100%) 2.7828

"""